In [896]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import seaborn as sns

df = pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [897]:
df['Family_number'] = df.SibSp + df.Parch + 1

In [898]:
df['Sex'] = df['Sex'].apply(lambda x : 1 if x == "male" else 0)

In [899]:
df[df.Age.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_number
5,6,0,3,"Moran, Mr. James",1,NaN,0,0,330877,8.4583,NaN,Q,1
17,18,1,2,"Williams, Mr. Charles Eugene",1,NaN,0,0,244373,13.0000,NaN,S,1
19,20,1,3,"Masselmani, Mrs. Fatima",0,NaN,0,0,2649,7.2250,NaN,C,1
26,27,0,3,"Emir, Mr. Farred Chehab",1,NaN,0,0,2631,7.2250,NaN,C,1
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",0,NaN,0,0,330959,7.8792,NaN,Q,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",1,NaN,0,0,2629,7.2292,NaN,C,1
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",0,NaN,8,2,CA. 2343,69.5500,NaN,S,11
868,869,0,3,"van Melkebeke, Mr. Philemon",1,NaN,0,0,345777,9.5000,NaN,S,1
878,879,0,3,"Laleff, Mr. Kristo",1,NaN,0,0,349217,7.8958,NaN,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.4500,NaN,S,4

In [900]:
print(df[df.Name.str.match(r'(^.*Mr\..*)') == True].Age.mean())
print(int(df[df.Name.str.match(r'(^.*Mrs\..*)') == True].Age.mean()))
print(df[df.Name.str.match(r'(^.*Miss\..*)') == True].Age.mean())
print(df[df.Name.str.match(r'(^.*Master\..*)') == True].Age.mean())

32.368090452261306
35
21.773972602739725
4.574166666666667

In [901]:
def age_fill(df):

    mean_mrs = int(df[df.Name.str.match(r'(^.*Mrs\..*)') == True].Age.mean()) 
    mean_mr = int(df[df.Name.str.match(r'(^.*Mr\..*)') == True].Age.mean())
    mean_miss = int(df[df.Name.str.match(r'(^.*Miss\..*)') == True].Age.mean())
    mean_master = int(df[df.Name.str.match(r'(^.*Master\..*)') == True].Age.mean())

    print(mean_master)

    for index, row in df.iterrows(): 
        if pd.isna(row.Age) :
            print("null")
            if 'Master.' in row.Name :
                row.Age = mean_master
                print(row.Age)
            elif 'Miss.' in row.Name :
                row.Age = mean_miss
                print(row.Age)
            elif 'Mrs.' in row.Name :
                row.Age = mean_mrs
                print(row.Age)
            else :
                row.Age = mean_mr
                print(row.Age)
    
    return df


#for index, row in df.iterrows(): 
#    if pd.isnull(row.Age) :
#        if row.Name.str.match(r'(^.*Master\..*)') == True :
#            row.Age =  mean_master
#        elif row.Name.str.match(r'(^.*Miss\..*)') == True :
#            row.Age = mean_miss
#        elif row.Name.str.match(r'(^.*Mrs\..*)') == True :
#            row.Age = mean_mrs
#        else :
#            row.Age = mean_mr

In [902]:
mean_mrs = int(df[df.Name.str.match(r'(^.*Mrs\..*)') == True].Age.mean()) 
mean_mr = int(df[df.Name.str.match(r'(^.*Mr\..*)') == True].Age.mean())
mean_miss = int(df[df.Name.str.match(r'(^.*Miss\..*)') == True].Age.mean())
mean_master = int(df[df.Name.str.match(r'(^.*Master\..*)') == True].Age.mean())

#df[(df.Name.str.match(r'(^.*Master\..*)') == True) & pd.isna(df.Age) ].Age = mean_master

#df.loc[5]['Age'] = 10
#df.loc[df['PassengerId'] == 6, ['Age']] = 10
#df.loc[5]['Age']

### to try and understand why it modify the dataframe
#
# df.loc[df['PassengerId'] == 6, ['Age']] = 10
#
# df.loc[5, 'Age']=10

df.loc[df["Age"].isnull() & df.Name.str.match(r'(^.*Mr\..*)') == True , "Age"] = mean_mr
df.loc[df["Age"].isnull() & df.Name.str.match(r'(^.*Dr\..*)') == True , "Age"] = mean_mr
df.loc[df["Age"].isnull() & df.Name.str.match(r'(^.*Mrs\..*)') == True , "Age"] = mean_mrs
df.loc[df["Age"].isnull() & df.Name.str.match(r'(^.*Master\..*)') == True , "Age"] = mean_master
df.loc[df["Age"].isnull() & df.Name.str.match(r'(^.*Miss\..*)') == True , "Age"] = mean_miss

In [903]:
df['Dr'] = 0
df['Mr'] = 0
df['Mrs'] = 0
df['Master'] = 0
df['Miss'] = 0

df.loc[df.Name.str.match(r'(^.*Mr\..*)') == True , "Mr"] = 1
df.loc[df.Name.str.match(r'(^.*Dr\..*)') == True , "Dr"] = 1
df.loc[df.Name.str.match(r'(^.*Mrs\..*)') == True , "Mrs"] = 1
df.loc[df.Name.str.match(r'(^.*Master\..*)') == True , "Master"] = 1
df.loc[df.Name.str.match(r'(^.*Miss\..*)') == True , "Miss"] = 1

In [904]:
df.loc[df.Name.str.match(r'(^.*Dr\..*)') == True]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_number,Dr,Mr,Mrs,Master,Miss
245,246,0,1,"Minahan, Dr. William Edward",1,44.0,2,0,19928,90.0000,C78,Q,3,1,0,0,0,0
317,318,0,2,"Moraweck, Dr. Ernest",1,54.0,0,0,29011,14.0000,NaN,S,1,1,0,0,0,0
398,399,0,2,"Pain, Dr. Alfred",1,23.0,0,0,244278,10.5000,NaN,S,1,1,0,0,0,0
632,633,1,1,"Stahelin-Maeglin, Dr. Max",1,32.0,0,0,13214,30.5000,B50,C,1,1,0,0,0,0
660,661,1,1,"Frauenthal, Dr. Henry William",1,50.0,2,0,PC 17611,133.6500,NaN,S,3,1,0,0,0,0
766,767,0,1,"Brewe, Dr. Arthur Jackson",1,32.0,0,0,112379,39.6000,NaN,C,1,1,0,0,0,0
796,797,1,1,"Leader, Dr. Alice (Farnham)",0,49.0,0,0,17465,25.9292,D17,S,1,1,0,0,0,0

In [905]:
col_name_delete = [ 'PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked', 'SibSp', 'Parch']
df = df.drop(columns=col_name_delete)
df

,Survived,Pclass,Sex,Age,Fare,Family_number,Dr,Mr,Mrs,Master,Miss
0,0,3,1,22.0,7.2500,2,0,1,0,0,0
1,1,1,0,38.0,71.2833,2,0,0,1,0,0
2,1,3,0,26.0,7.9250,1,0,0,0,0,1
3,1,1,0,35.0,53.1000,2,0,0,1,0,0
4,0,3,1,35.0,8.0500,1,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,13.0000,1,0,0,0,0,0
887,1,1,0,19.0,30.0000,1,0,0,0,0,1
888,0,3,0,21.0,23.4500,4,0,0,0,0,1
889,1,1,1,26.0,30.0000,1,0,1,0,0,0
890,0,3,1,32.0,7.7500,1,0,1,0,0,0

In [906]:
df.isnull().sum()

Survived         0
Pclass           0
Sex              0
Age              0
Fare             0
Family_number    0
Dr               0
Mr               0
Mrs              0
Master           0
Miss             0
dtype: int64

In [907]:
df

,Survived,Pclass,Sex,Age,Fare,Family_number,Dr,Mr,Mrs,Master,Miss
0,0,3,1,22.0,7.2500,2,0,1,0,0,0
1,1,1,0,38.0,71.2833,2,0,0,1,0,0
2,1,3,0,26.0,7.9250,1,0,0,0,0,1
3,1,1,0,35.0,53.1000,2,0,0,1,0,0
4,0,3,1,35.0,8.0500,1,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,13.0000,1,0,0,0,0,0
887,1,1,0,19.0,30.0000,1,0,0,0,0,1
888,0,3,0,21.0,23.4500,4,0,0,0,0,1
889,1,1,1,26.0,30.0000,1,0,1,0,0,0
890,0,3,1,32.0,7.7500,1,0,1,0,0,0

In [908]:
# Add your code to analyse the data here: ---> ???

In [909]:
#Create feature and target

X= df.drop('Survived',axis=1) 
y= df[['Survived']]

In [910]:
print(X.shape)
print(y.shape)

(891, 10)
(891, 1)

In [911]:
#scale the features
from sklearn.preprocessing import StandardScaler

sc = StandardScaler()

X = sc.fit_transform(X)

In [912]:
# Import the model
from sklearn.linear_model import LogisticRegression
# Declare an instance of it
classifier = LogisticRegression(solver='lbfgs')
# Fit the model
classifier.fit(X,y)

LogisticRegression()

In [913]:
df_test = pd.read_csv("test.csv")

df_prediction = pd.DataFrame()
df_prediction['PassengerId'] = df_test['PassengerId']

In [914]:
#CLEAN TEST DATA

df_test['Family_number'] = df_test.SibSp + df_test.Parch + 1
df_test['Sex'] = df_test['Sex'].apply(lambda x : 1 if x == "male" else 0)


df_test.loc[df_test["Age"].isnull() & df_test.Name.str.match(r'(^.*Mr\..*)') == True , "Age"] = mean_mr
df_test.loc[df_test["Age"].isnull() & df_test.Name.str.match(r'(^.*Dr\..*)') == True , "Age"] = mean_mr
df_test.loc[df_test["Age"].isnull() & df_test.Name.str.match(r'(^.*Mrs\..*)') == True , "Age"] = mean_mrs
df_test.loc[df_test["Age"].isnull() & df_test.Name.str.match(r'(^.*Master\..*)') == True , "Age"] = mean_master
df_test.loc[df_test["Age"].isnull() & df_test.Name.str.match(r'(^.*Miss\..*)') == True , "Age"] = mean_miss


df_test['Dr'] = 0
df_test['Mr'] = 0
df_test['Mrs'] = 0
df_test['Master'] = 0
df_test['Miss'] = 0

df_test.loc[df_test.Name.str.match(r'(^.*Mr\..*)') == True , "Mr"] = 1
df_test.loc[df_test.Name.str.match(r'(^.*Dr\..*)') == True , "Dr"] = 1
df_test.loc[df_test.Name.str.match(r'(^.*Mrs\..*)') == True , "Mrs"] = 1
df_test.loc[df_test.Name.str.match(r'(^.*Master\..*)') == True , "Master"] = 1
df_test.loc[df_test.Name.str.match(r'(^.*Miss\..*)') == True , "Miss"] = 1

col_name_delete = [ 'PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked', 'SibSp', 'Parch']
df_test = df_test.drop(columns=col_name_delete)


# fill one age
df_test[df_test['Age'].isnull()]
df_test.loc[88,'Age'] = mean_mrs
df_test.loc[88,'Mrs'] = 1
df_test.iloc[88]

#fill one fare
df_test[df_test['Fare'].isnull()]
df_test.loc[152,'Fare'] = df[df.Pclass == 3].Fare.mean()
df_test.iloc[152]

Pclass            3.00000
Sex               1.00000
Age              60.50000
Fare             13.67555
Family_number     1.00000
Dr                0.00000
Mr                1.00000
Mrs               0.00000
Master            0.00000
Miss              0.00000
Name: 152, dtype: float64

In [915]:
#scale the features
from sklearn.preprocessing import StandardScaler

sc = StandardScaler()

X_test = sc.fit_transform(df_test)

In [916]:
# Evaluate the model
prediction = classifier.predict(X_test)
df_prediction['Survived'] = prediction
df_prediction

df_prediction.to_csv("Titanic_prediction_result_mikdom.csv", index=False)
df_prediction_read = pd.read_csv("Titanic_prediction_result_mikdom.csv")
df_prediction_read

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]